app/views/classrooms/_form.html.erb

SELECT `courses`.* FROM `courses`
---
				  				<div class="col-xs-2">
					    			<%= f.association :course, label: "Curso", prompt: 'Selectione o Curso', label_method: :name, collection: Course.all %>

SELECT `users`.* FROM `users`
---
				  				<div class="col-xs-2">
					    			<%= f.association :user, prompt: 'Selectione o aluno', label_method: :name, collection: User.all %>