app/views/welcome/current_courses.html.erb

              <h4><i class="glyphicon glyphicon-time"></i> <%= course.workload %> horas </h4>
              <% if current_user.present? && current_user.role?('estudante') %>
---
SELECT `roles`.* FROM `roles` INNER JOIN `roles_users` ON `roles`.`id` = `roles_users`.`role_id` WHERE `roles_users`.`user_id` = 1