app/views/welcome/see_more.html.erb

SELECT `users`.* FROM `users` INNER JOIN `courses_users` ON `users`.`id` = `courses_users`.`user_id` WHERE `courses_users`.`course_id` = 1
---

			<% @course.users.each do |u| %>