app/views/courses/show.html.erb


      <% @course.users.each do |u| %>
---
SELECT `users`.* FROM `users` INNER JOIN `courses_users` ON `users`.`id` = `courses_users`.`user_id` WHERE `courses_users`.`course_id` = 1