app/controllers/classrooms_controller.rb

  def index
    @classrooms = Classroom.all
---
SELECT `classrooms`.* FROM `classrooms`