app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT `courses`.* FROM `courses`

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`created_at`, `end_date`, `image`, `maximum_capacity`, `minimum_capacity`, `name`, `specification`, `start_date`, `updated_at`, `workload`) VALUES ('2014-04-24 13:53:08', '2014-04-20', 'ruby_on_rails.png', 20, 10, 'Ruby On Rails', 'Curso de Desenvolvimento Ágil + Ruby on Rails', '2014-04-17', '2014-04-24 13:53:08', '20')

  def register
    @course = Course.find(params[:id])
    if current_user.present? && current_user.role?("estudante")
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
SELECT `roles`.* FROM `roles` INNER JOIN `roles_users` ON `roles`.`id` = `roles_users`.`role_id` WHERE `roles_users`.`user_id` = 4

  def registered_students
    # Recover from db, students that had been registered in that course.
    add_breadcrumb "List Courses", courses_path
    add_breadcrumb "List Students", registered_students_courses_path(@course)
    @students = User.includes(:courses).where("courses.id = '#{@course.id}' && type = 'Student'")
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

  def destroy
    @course.destroy
---
DELETE FROM `courses` WHERE `courses`.`id` = 2

    def set_course
      @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 2 LIMIT 1