app/controllers/partners_controller.rb

SELECT `partners`.* FROM `partners`
---
  def index
    @partners = Partner.all