app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects`
---
  def index
    @projects = Project.all