app/controllers/students_controller.rb

SELECT `roles`.* FROM `roles` WHERE `roles`.`name` = 'estudante'
---
  def create
    @student = Student.new(student_params)
    if @student.roles.empty?
      @student.roles << Role.where(name: "estudante")