app/controllers/welcome_controller.rb

  def partners
  	@partners = Partner.all
---
SELECT `partners`.* FROM `partners`

  def projects
    @projects = Project.all
---
SELECT `projects`.* FROM `projects`

  def see_more
    @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1

  def current_courses
    @courses = Course.all
---
SELECT `courses`.* FROM `courses`