app/views/layouts/_navbar.html.erb

SELECT `roles`.* FROM `roles` INNER JOIN `roles_users` ON `roles`.`id` = `roles_users`.`role_id` WHERE `roles_users`.`user_id` = 1
---

		    	<% if current_user.present? && current_user.role?('admin') %>